In [1]:
import pandas as pd

In [2]:
#base_df = pd.read_excel("base-data.xlsx")
file_name = "base-data.xlsx"
#exploring_actor_vial_df = pd.read_excel(io=file_name, sheet_name='ACTOR_VIAL')
#exploring_vehiculos_df = pd.read_excel(io=file_name, sheet_name='VEHICULOS')

siniestros_df = pd.read_excel(io=file_name, sheet_name='SINIESTROS')
hipothesis_df = pd.read_excel(io=file_name, sheet_name='HIPOTESIS')

# Combining Dataframes
see: https://datacarpentry.org/python-ecology-lesson/05-merging-data.html

It appears (from looking at the data in excel) that diniestros and hipothesis are the only two datapoints that are 1-1, whereas the others are metadata about each car crash.

In [3]:
siniestros_df["CODIGO_ACCIDENTE"].nunique()

196152

In [4]:
hipothesis_df["CODIGO_ACCIDENTE"].nunique()

195735

In [5]:
common_keys = ['CODIGO_ACCIDENTE','FECHA']

In [6]:
merged_inner = pd.merge(left=siniestros_df, right=hipothesis_df, left_on=common_keys, right_on=common_keys)

In [7]:
(merged_inner.query("CODIGO_ACCIDENTE == 4401444"))

,CODIGO_ACCIDENTE,FECHA,HORA,GRAVEDAD,CLASE,CHOQUE,OBJETO_FIJO,DIRECCION,CODIGO_LOCALIDAD,DISENO_LUGAR,CODIGO_CAUSA
157,4401444,04/01/2015,16:00:00,2,1,1.0,NaN,KR 45A-CL 131 02,11,2,112
158,4401444,04/01/2015,16:00:00,2,1,1.0,NaN,KR 45A-CL 131 02,11,2,157

In [8]:
(hipothesis_df.query("CODIGO_ACCIDENTE == 4401444"))

     CODIGO_ACCIDENTE       FECHA CODIGO_CAUSA
131           4401444  04/01/2015          112
132           4401444  04/01/2015          157

# Trying to match them together

We can pre-process hipothesis to have lists of codigo causa instead of multiple row

In [102]:
#https://stackoverflow.com/questions/46275765/pandas-merge-row-data-with-multiple-values-to-python-list-for-a-column
#grouped_hipothesis_df = hipothesis_df.groupby(['CODIGO_ACCIDENTE','FECHA']).agg(lambda x: x.tolist())#.apply(lambda x: 12, axis = 1, result_type= "expand")
#grouped_hipothesis_df
def tiny(series, n=4):
    l =  series.tolist()
    while len(l) < n: # n magic number
        l.append(-1)
        
    return l
#hdf = hipothesis_df.query("CODIGO_ACCIDENTE == 10535475").groupby(['CODIGO_ACCIDENTE','FECHA']).agg(tiny)#.apply(lambda x: x + 4, axis = 1, result_type= "expand")
#hdf[['cc1','cc2','cc3','cc4','cc5','cc6','cc7']] = pd.DataFrame(hdf.CODIGO_CAUSA.tolist(), index= hdf.index)
#hdf

In [103]:
grouped_hipothesis_df = hipothesis_df.drop_duplicates().groupby(['CODIGO_ACCIDENTE','FECHA']).agg(tiny)

In [104]:
grouped_hipothesis_df.query("CODIGO_ACCIDENTE == 4508250")

                                   CODIGO_CAUSA
CODIGO_ACCIDENTE FECHA
4508250          11/02/2018  [116, 141, -1, -1]

In [97]:
for i in grouped_hipothesis_df.CODIGO_CAUSA.tolist():
    if len(i) > 4: 
        print(i)

[139, 302, 116, 121, 301]

In [98]:
grouped_hipothesis_df[['CC1','CC2','CC3','CC4','CC5']] = pd.DataFrame(grouped_hipothesis_df.CODIGO_CAUSA.tolist(), index= grouped_hipothesis_df.index)

In [101]:
grouped_hipothesis_df.query("CC5 > 0")

,,CODIGO_CAUSA,CC1,CC2,CC3,CC4,CC5
CODIGO_ACCIDENTE,FECHA,,,,,,
4491301,22/08/2017,"[139, 302, 116, 121, 301]",139,302,116,121,301.0

In [66]:
merged_inner = pd.merge(left=siniestros_df, right=grouped_hipothesis_df, left_on=common_keys, right_on=common_keys)

In [67]:
merged_inner

,CODIGO_ACCIDENTE,FECHA,HORA,GRAVEDAD,CLASE,CHOQUE,OBJETO_FIJO,DIRECCION,CODIGO_LOCALIDAD,DISENO_LUGAR,CODIGO_CAUSA,CC1,CC2,CC3,CC4,CC5,CC6,CC7
0,4401438,01/01/2015,01:05:00,2,2,NaN,NaN,KR 64A-CL 2C 02,16,2,"[157, -1, -1, -1, -1, -1, -1]",157,-1,-1,-1,-1,-1,-1
1,4401449,01/01/2015,05:50:00,2,3,NaN,NaN,AV AVENIDA DEL SUR-KR 65A 41,7,1,"[114, -1, -1, -1, -1, -1, -1]",114,-1,-1,-1,-1,-1,-1
2,4401430,01/01/2015,07:15:00,2,3,NaN,NaN,KR 19D-CL 62 S 02,19,1,"[157, -1, -1, -1, -1, -1, -1]",157,-1,-1,-1,-1,-1,-1
3,4401453,01/01/2015,09:30:00,3,1,1.0,NaN,KR 79-CL 42F S 71,8,1,"[157, 139, -1, -1, -1, -1, -1]",157,139,-1,-1,-1,-1,-1
4,4401423,01/01/2015,09:45:00,2,1,1.0,NaN,CL 66A-KR 76 02,10,2,"[112, -1, -1, -1, -1, -1, -1]",112,-1,-1,-1,-1,-1,-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195730,10530481,31/12/2020,21:20:00,3,1,1.0,NaN,CL 42-KR 86 S 02,8,1,"[157, -1, -1, -1, -1, -1, -1]",157,-1,-1,-1,-1,-1,-1
195731,10530439,31/12/2020,21:30:00,2,1,1.0,NaN,KR 111-CL 171 02,11,2,"[157, -1, -1, -1, -1, -1, -1]",157,-1,-1,-1,-1,-1,-1
195732,10530491,31/12/2020,21:34:00,3,1,1.0,NaN,CL 134-KR 5 08,1,1,"[157, 157, -1, -1, -1, -1, -1]",157,157,-1,-1,-1,-1,-1
195733,10531380,31/12/2020,21:40:00,2,1,1.0,NaN,CL 142 - KR 146 02,11,1,"[104, -1, -1, -1, -1, -1, -1]",104,-1,-1,-1,-1,-1,-1
195734,10530469,31/12/2020,22:34:00,3,1,1.0,NaN,KR 52-DG 16 S 02,16,2,"[121, -1, -1, -1, -1, -1, -1]",121,-1,-1,-1,-1,-1,-1

In [ ]:
grouped_hipothesis_df = hipothesis_df.groupby(['CODIGO_ACCIDENTE','FECHA']).agg(lambda x: x.tolist())

# Using Google Maps

In [12]:
direcciones_raw = (base_df.DIRECCION).to_list()

NameError: name 'base_df' is not defined

In [ ]:
API_KEY = "AIzaSyATI9kNs1r55SkUdqtWcNNK0gJJnecb09Y"

In [ ]:
direcciones_raw

In [67]:
l = [1,2,3]

In [72]:
l.extend([-1]* (max_len - len(l)))

In [73]:
l

[1, 2, 3, -1]